Luos-io/LuosHAL/STM32F0/luos_hal.c
    // Transmission management
    if ((LL_USART_IsActiveFlag_TC(LUOS_COM) != RESET) && (LL_USART_IsEnabledIT_TC(LUOS_COM) != RESET))
    {
        // Transmission complete
        // Switch to reception mode
        LuosHAL_SetRxState(true);
        LuosHAL_SetTxState(false);
        // Disable transmission complete IRQ
        LL_USART_ClearFlag_TC(LUOS_COM);
        LL_USART_DisableIT_TC(LUOS_COM);
    }
    else if ((LL_USART_IsActiveFlag_TXE(LUOS_COM) != RESET) && (LL_USART_IsEnabledIT_TXE(LUOS_COM) != RESET))
    {
        // Transmit buffer empty (this is a software DMA)
        data_size_to_transmit--;
        LL_USART_TransmitData8(LUOS_COM, *(tx_data++));
        if (data_size_to_transmit == 0)
        {
            // Transmission complete, stop loading data and watch for the end of transmission
            // Disable Transmission empty buffer interrupt
            LL_USART_DisableIT_TXE(LUOS_COM);
            // Enable Transmission complete interrupt
            LL_USART_EnableIT_TC(LUOS_COM);
        }
    }
}
/******************************************************************************
 * @brief Process data transmit
 * @param None
 * @return None
 ******************************************************************************/
void LuosHAL_ComTransmit(uint8_t *data, uint16_t size)
{
    while (LL_USART_IsActiveFlag_TXE(LUOS_COM) == RESET)
        ;
    // Disable RX detec pin if needed
    // Enable TX
    LuosHAL_SetTxState(true);
    // Reduce size by one because we send one directly
    data_size_to_transmit = size - 1;
    // Reset timeout timer
    LuosHAL_ResetTimeout(DEFAULT_TIMEOUT);
    if (size > 1)
    {
        // Start the data buffer transmission
        // **** NO DMA
        //Copy the data pointer globally alowing to keep it and run the transmission.
        tx_data = data;
        // Send the first byte
        LL_USART_TransmitData8(LUOS_COM, *(tx_data++));
        // Enable Transmission empty buffer interrupt to transmit next datas
        LL_USART_EnableIT_TXE(LUOS_COM);
        // **** DMA
        // Setup DMA and run it
        // Enable Transmission complete interrupt.
    }
    else
    {
        // Transmit the only byte we have
        LL_USART_TransmitData8(LUOS_COM, *data);
        // Enable Transmission complete interrupt because we only have one.
        LL_USART_EnableIT_TC(LUOS_COM);
    }
}
/******************************************************************************
 * @brief set state of Txlock detection pin
 * @param None
 * @return Lock status
 ******************************************************************************/
void LuosHAL_SetRxDetecPin(uint8_t Enable)
{
    if (TX_LOCK_DETECT_IRQ != DISABLE)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(TX_LOCK_DETECT_IRQ);
        if (Enable == true)
        {
            EXTI->IMR |= TX_LOCK_DETECT_PIN;
        }
        else
        {
            EXTI->IMR &= ~TX_LOCK_DETECT_PIN;
        }
    }
}
/******************************************************************************
 * @brief get Lock Com transmit status this is the HW that can generate lock TX
 * @param None
 * @return Lock status
 ******************************************************************************/
uint8_t LuosHAL_GetTxLockState(void)
{
    uint8_t result = false;

#ifdef USART_ISR_BUSY
    if (READ_BIT(LUOS_COM->ISR, USART_ISR_BUSY) == (USART_ISR_BUSY))
    {
        LuosHAL_ResetTimeout(DEFAULT_TIMEOUT);
        result = true;
    }
#else
    if ((TX_LOCK_DETECT_PIN != DISABLE) && (TX_LOCK_DETECT_PORT != DISABLE))
    {
        if (TX_LOCK_DETECT_IRQ == DISABLE)
        {
            result = HAL_GPIO_ReadPin(TX_LOCK_DETECT_PORT, TX_LOCK_DETECT_PIN);
            if (result == true)
            {
                LuosHAL_ResetTimeout(DEFAULT_TIMEOUT);
            }
        }
    }
#endif
    return result;
}
/******************************************************************************
 * @brief Luos Timeout initialisation
 * @param None
 * @return None
 ******************************************************************************/
static void LuosHAL_TimeoutInit(void)
{
    //initialize clock
    LUOS_TIMER_CLOCK_ENABLE();

    TimerHandle.Instance = LUOS_TIMER;
    TimerHandle.Init.Period = DEFAULT_TIMEOUT;
    TimerHandle.Init.Prescaler = Timer_Prescaler - 1;
    TimerHandle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    TimerHandle.Init.CounterMode = TIM_COUNTERMODE_UP;
    TimerHandle.Init.RepetitionCounter = 0;
    TimerHandle.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_Base_Init(&TimerHandle) != HAL_OK)
    {
        while (1)
            ;
    }
    HAL_NVIC_SetPriority(LUOS_TIMER_IRQ, 0, 2);
    HAL_NVIC_EnableIRQ(LUOS_TIMER_IRQ);
}
/******************************************************************************
 * @brief Luos Timeout for Rx communication
 * @param None
 * @return None
 ******************************************************************************/
void LuosHAL_ResetTimeout(uint16_t nbrbit)
{
    LUOS_TIMER->CR1 &= ~(TIM_CR1_CEN);               // Disable counter
    NVIC_ClearPendingIRQ(LUOS_TIMER_IRQ);            // Clear IT pending
    __HAL_TIM_CLEAR_IT(&TimerHandle, TIM_IT_UPDATE); // Clear IT flag
    LUOS_TIMER->CNT = 0;                             // Reset counter
    LUOS_TIMER->ARR = nbrbit;                        //reload value
    __HAL_TIM_ENABLE_IT(&TimerHandle, TIM_IT_UPDATE);
    LUOS_TIMER->CR1 |= TIM_CR1_CEN; // Enable counter
}
/******************************************************************************
 * @brief Luos Timeout for Rx communication
 * @param None
 * @return None
 ******************************************************************************/
static inline void LuosHAL_ComTimeout(void)
{
    if (__HAL_TIM_GET_FLAG(&TimerHandle, TIM_FLAG_UPDATE) != RESET)
    {
        __HAL_TIM_CLEAR_IT(&TimerHandle, TIM_IT_UPDATE);
        LUOS_TIMER->CR1 &= ~(TIM_CR1_CEN);
        if (ctx.tx.lock == true)
        {
            // Enable RX detection pin if needed
            Recep_Timeout();
        }
    }
}
/******************************************************************************
 * @brief Initialisation GPIO
 * @param None
 * @return None
 ******************************************************************************/
static void LuosHAL_GPIOInit(void)
{
    //Activate Clock for PIN choosen in luosHAL
    PORT_CLOCK_ENABLE();

    if ((RX_EN_PIN != DISABLE) || (RX_EN_PORT != DISABLE))
    {
        /*Configure GPIO pins : RxEN_Pin */
        GPIO_InitStruct.Pin = RX_EN_PIN;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(RX_EN_PORT, &GPIO_InitStruct);
    }

    if ((TX_EN_PIN != DISABLE) || (TX_EN_PORT != DISABLE))
    {
        /*Configure GPIO pins : TxEN_Pin */
        GPIO_InitStruct.Pin = TX_EN_PIN;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(TX_EN_PORT, &GPIO_InitStruct);
    }

